In [ ]:
### Concatenation , merge and joining data frames in pandas

**Lets Understand concatenation**

In [ ]:
import pandas as pd
df1=pd.DataFrame({'item':['A','B','C','D'],
                  'value':[1,2,3,5]})
df2=pd.DataFrame({'item':['E','F','G','H'],
                  'value':[5,6,7,8]})
print(df1)
print(df2)

  item  value
0    A      1
1    B      2
2    C      3
3    D      5
  item  value
0    E      5
1    F      6
2    G      7
3    H      8

In [ ]:
df1

  item  value
0    A      1
1    B      2
2    C      3
3    D      5

In [ ]:
df2

  item  value
0    E      5
1    F      6
2    G      7
3    H      8

In [ ]:
pd.concat([df1,df2])

  item  value
0    A      1
1    B      2
2    C      3
3    D      5
0    E      5
1    F      6
2    G      7
3    H      8

In [ ]:
import pandas as pd
df1=pd.DataFrame({'item':['A','B','C','D'],
                  'value':[1,2,3,4]})
df2=pd.DataFrame({'item':['E','F','G','H'],
                  'value':[5,6,7,8]})
print(df1)
print(df2)

  item  value
0    A      1
1    B      2
2    C      3
3    D      4
  item  value
0    E      5
1    F      6
2    G      7
3    H      8

In [ ]:
pd.concat([df1,df2])

  item  value
0    A      1
1    B      2
2    C      3
3    D      4
0    E      5
1    F      6
2    G      7
3    H      8

In [ ]:
df1=pd.DataFrame({'Item':['A','B','C','D'],
                  'Value':[1,2,3,5]})
df2=pd.DataFrame({'item':['E','F','G','H'],
                  'value':[5,6,7,8]})
pd.concat([df1,df2])

  Item  Value item  value
0    A    1.0  NaN    NaN
1    B    2.0  NaN    NaN
2    C    3.0  NaN    NaN
3    D    5.0  NaN    NaN
0  NaN    NaN    E    5.0
1  NaN    NaN    F    6.0
2  NaN    NaN    G    7.0
3  NaN    NaN    H    8.0

In [ ]:
df1=pd.DataFrame({'Item':['A','B','C','D'],
                  'Value':[1,2,3,5]})
df2=pd.DataFrame({'Item':['E','F','G','H'],
                  'Quantity':[5,6,7,8]})
pd.concat([df1,df2])

  Item  Value  Quantity
0    A    1.0       NaN
1    B    2.0       NaN
2    C    3.0       NaN
3    D    5.0       NaN
0    E    NaN       5.0
1    F    NaN       6.0
2    G    NaN       7.0
3    H    NaN       8.0

In [ ]:
df1=pd.DataFrame({'Item':['A','B','C','D'],
                  'Value':[1,2,3,5]})
df2=pd.DataFrame({'Item':['E','F','G','H'],
                  'Quantity':[5,6,7,8]})
pd.concat([df1,df2]).reset_index()

   index Item  Value  Quantity
0      0    A    1.0       NaN
1      1    B    2.0       NaN
2      2    C    3.0       NaN
3      3    D    5.0       NaN
4      0    E    NaN       5.0
5      1    F    NaN       6.0
6      2    G    NaN       7.0
7      3    H    NaN       8.0

In [ ]:
pd.concat([df1,df2],axis=1)

  Item  Value Item  Quantity
0    A      1    E         5
1    B      2    F         6
2    C      3    G         7
3    D      5    H         8

**use append to add multiple dataframes to one another**

In [ ]:
df1=pd.DataFrame({'item':['A','B','C','D'],
                  'value':[1,2,3,5]})
df2=pd.DataFrame({'item':['E','F','G','H'],
                  'value':[5,6,7,8]})
df3=pd.DataFrame({'item':['I','J','K','L'],
                  'value':[10,20,30,50]})
df1.append([df2,df3]).reset_index()

    index item  value
0       0    A      1
1       1    B      2
2       2    C      3
3       3    D      5
4       0    E      5
5       1    F      6
6       2    G      7
7       3    H      8
8       0    I     10
9       1    J     20
10      2    K     30
11      3    L     50

In [ ]:
dfA=pd.DataFrame({'Key':['A','B','C','D'],
                  'A':[1,2,3,5]})
dfB=pd.DataFrame({'Key':['E','F','G','H'],
                  'B':[5,6,7,8]})
pd.merge(dfA,dfB, on='Key')

Empty DataFrame
Columns: [Key, A, B]
Index: []

In [ ]:
dfA=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})
dfB=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']})
pd.merge(dfA,dfB, on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [ ]:
dfA=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})
dfB=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']})
dfA

  Key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [ ]:
dfA=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})
dfB=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']})
pd.merge(dfA,dfB,how='left',on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [ ]:
dfA=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})
dfB=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']})
pd.merge(dfA,dfB,how='right',on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [ ]:
dfA=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})
dfB=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']})
pd.merge(dfA,dfB,how='inner',on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

**Joining**

In [ ]:
left=pd.DataFrame({'A':['K0','K1','K2','K3'],
                  'B':['A0','A1','A2','A3']},
                  index = ['B0','B1','B2','B3'])

In [ ]:
left

     A   B
B0  K0  A0
B1  K1  A1
B2  K2  A2
B3  K3  A3

In [ ]:
left=pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']},
                   index=['K0','K1','K2','K3'])

In [ ]:
right=pd.DataFrame({'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']},
                   index=['K0','K1','K2','K3'])

In [ ]:
left.join(right)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [ ]:
left.join(right,how='outer')

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [ ]:
#python program for finding H.C.F of 2 input numbers

def computeHCF(x,y):

#choose the smaller number
  if x>y:
    smaller=y
  else:
      smaller=x
  for i in range(1,smaller+1):
    if ((x%i==0) and (y % i==0)):
          hcf=i

  return hcf
num1 = int(input("Enter first number"))
num2 = int(input("Enter second number"))
print("H.C.F of ",num1,"and",num2,"is",computeHCF(num1,num2 ) )

Enter first number54
Enter second number22
H.C.F of  54 and 22 is 2

In [ ]:
#python program for finding H.C.F of 2 input numbers

def computeHCF(x,y):

#choose the smaller number
  if x>y:
    smaller=y
  else:
      smaller=x
  for i in range(1,smaller+1):
    if ((x % i == 0) and (y % i == 0)):
          hcf=i

  return hcf
num1 = 54
num2 = 22
print("H.C.F of ",num1,"and",num2,"is",computeHCF(num1,num2 ) )

H.C.F of  54 and 22 is 2

**Python Dictionaries**

In [ ]:
thisdict={
    "Brand":"Ford",
    "Model":'Mustand',
    "Year":1964
}
print(thisdict)

{'Brand': 'Ford', 'Model': 'Mustand', 'Year': 1964}

In [ ]:
thisdict={
    "Brand":"BMW",
    "Model":'GS 310 G',
    "Year":2015,
    'Country':'Germany'
}
print(thisdict['Country'])

Germany

In [ ]:
thisdict={
    "Brand":"BMW",
    "Model":'GS 310 G',
    "Year":2015,
    'Country':'Germany',
    'Year':2020
}
print(thisdict['Year'])

2020

In [ ]:
print(len(thisdict))

4

In [ ]:
thisdict={
    "Brand":"BMW",
    "Model":'GS 310 G',
    'Country':'Germany',
    'Year':2020
}
print(thisdict['Year'])

2020

In [ ]:
print(len(thisdict))

4

In [ ]:
thisdict={
    "Brand":"BMW",
    "Model":'GS 310 G',
    'Year':2020
}
print(thisdict['Year'])

2020

In [ ]:
print(len(thisdict))

3

In [ ]:
thisdict={
    "Brand":"BMW",
    "Model":'GS 310 G',
    'Country':'Germany',
    'Year':2015,
    'colors':['red','white','Rally Edition']
}
print(thisdict)

{'Brand': 'BMW', 'Model': 'GS 310 G', 'Country': 'Germany', 'Year': 2015, 'colors': ['red', 'white', 'Rally Edition']}

In [ ]:
thisdict={
    "Brand":"BMW",
    "Model":'GS 310 G',
    'Country':'Germany',
    'Year':2015,
    'colors':['red','white','Rally Edition']
}
thisdict['Year']=2020
print(thisdict)
print(type(thisdict))

{'Brand': 'BMW', 'Model': 'GS 310 G', 'Country': 'Germany', 'Year': 2020, 'colors': ['red', 'white', 'Rally Edition']}
<class 'dict'>

In [ ]:
thisdict={
    "Brand":"BMW",
    "Model":'GS 310 G',
    'Country':'Germany',
    'Year':2015,
    'colors':['red','white','Rally Edition']
}
thisdict.update({'Prem Raj':'First owner'})
print(thisdict)

{'Brand': 'BMW', 'Model': 'GS 310 G', 'Country': 'Germany', 'Year': 2015, 'colors': ['red', 'white', 'Rally Edition'], 'Prem Raj': 'First owner'}

In [ ]:
thisdict={
    "Brand":"BMW",
    "Model":'GS 310 G',
    'Country':'Germany',
    'Year':2015,
    'colors':['red','white','Rally Edition']
}
thisdict.pop('colors')
print(thisdict)

{'Brand': 'BMW', 'Model': 'GS 310 G', 'Country': 'Germany', 'Year': 2015}

In [ ]:
thisdict={
    "Brand":"BMW",
    "Model":'GS 310 G',
    'Country':'Germany',
    'Year':2015,
    'colors':['red','white','Rally Edition']
}
del thisdict['Year']
print(thisdict)

{'Brand': 'BMW', 'Model': 'GS 310 G', 'Country': 'Germany', 'colors': ['red', 'white', 'Rally Edition']}

In [ ]:
thisdict={
    "Brand":"BMW",
    "Model":'GS 310 G',
    'Country':'Germany',
    'Year':2015,
    'colors':['red','white','Rally Edition']
}
thisdict.clear()
print(thisdict)

{}

In [ ]:
thisdict={
    "Brand":"BMW",
    "Model":'GS 310 G',
    'Country':'Germany',
    'Year':2015,
    'colors':['red','white','Rally Edition']
}
Newdict=thisdict.copy()
print(Newdict)

{'Brand': 'BMW', 'Model': 'GS 310 G', 'Country': 'Germany', 'Year': 2015, 'colors': ['red', 'white', 'Rally Edition']}

In [ ]:
thisdict={
    "child":{
    "name":'Premraj',
    'year':2001
    },
    'child2':{
    'name':'raghul',
    'year':1992
    },
    'child3':{
    'name':'dinesh',
    'year':1990
    }
}
print(thisdict)

{'child': {'name': 'Premraj', 'year': 2001}, 'child2': {'name': 'raghul', 'year': 1992}, 'child3': {'name': 'dinesh', 'year': 1990}}

In [ ]:
a=333
b=33
c=340
if a>b and c>a:
  print("Both condition are true")

Both condition are true

In [ ]:
a=333
b=33
c=340
if a>b and c>a:
  print("Aleast one of the condition are true")

Aleast one of the condition are true

**Nested If**

In [ ]:
x=41
if x>10:
  print("It is Above the vlue 10")
  if x>20:
     print("It is Above the vlue 20")
  else:
       print("But not above 20")

It is Above the vlue 10
It is Above the vlue 20

In [ ]:
#while loop
i=1
while i<6:
  print(i)
  i +=1

1
2
3
4
5

In [ ]:
i=1
while i<6:
  print(i)
  if (i==3):
    break 
  i +=1

1
2
3

In [ ]:
i=1
while i<6:
  print(i)
  i +=1
else:
  print("i is no longer less than 6")

1
2
3
4
5
i is no longer less than 6

In [ ]:
# python program to find the L.C.M of 2 input numbers

def lcm(x,y):
  if (x > y):
    greater=x
  else:
    greater=y
  while (True):
   if ((greater %x == 0) and (greater %y == 0)):
     lcm=greater
     break
   greater +=1

  return lcm
num1 = int(input("Enter first number"))
num2 = int(input("Enter second number"))
print("L.C.M of ",num1,"and",num2,"is",lcm(num1,num2 ) )

Enter first number54
Enter second number24
L.C.M of  54 and 24 is 216